---
kind: method
id: M:Autodesk.Revit.DB.ViewSchedule.GetTableData
zh: 明细表
source: html/e067f2c7-f809-89d4-5b61-a93004e3710d.htm
---
# Autodesk.Revit.DB.ViewSchedule.GetTableData Method

**中文**: 明细表

Gets the writable table data object.

## Syntax (C#)
```csharp
public TableData GetTableData()
```

## Returns
The schedule data object.